#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "07f834cb6227fe085b553930003bb5de" -> "1b856460c02732bf900a301aeac5d0f9"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "aa75907c18e421b4ceccba3de1d6c7ae" -> "80f6f95f1c3257be7608647ddd493b8a"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "bdc7713041da0068c12978d436d66803" -> "12238f71626966fe49f22334eaf9cc8d"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "453e4384c736fa1797d4438e122bbf71" -> "17cf0c72c63c8e495909a54c48ced27b"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "2d7bcd3117c5a158f2a8b5b902d7a7ff" -> "dad8af61bdcc1fa9551bc93b154d775e"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "a9b24088629c5aa5a588e451965ed616" -> "9fed957e6ab5112aa1ef1f5fa477e074"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "e959a9c9461fcefec688df50db184ae9" -> "6e245029054cdb498fe3f923d9844392"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "bbc72e87c03b5d8fa5c1f7b98f81d8c6" -> "febd38f9b0d1c29b5c6b6facbaa8aafd"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "a19cd238838913055f074a41b949e872" -> "7d828704913d7b3069cb11a9be222147"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "601ff53a29a4e23d68d01161340436ac" -> "03ac85f34fdcfb4c719352852c7bae73"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "8d259c495fe20b773fd78167aae6cb8d" -> "faf2ddfe4d0ec3957ebf319ac0b7c400"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "7c7a5708cd1f541f77db2e6e2fc527cb" -> "8404c4198222cc9f419b180e3769f7eb"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "d1a17e0fab4c38041a8f468d97251217" -> "6828e6d06777571e641038c569b4c435"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "09f0d2410641ad2d3fbf33ef3417c8b3" -> "f3a7d89a6b584a2c792e63aba96b380d"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "f3f6c5665297d31021033353f1f955bb" -> "60291f212251f9d08842f41796e55bef"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "e9652ab12003c7f37ce5b9ce079bfb7b" -> "a4ba916c7a105ad5b5fc85649e3f52c6"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "e61137c0a52c4c8bf97273e6b68618dd" -> "ff03520b944e1663b3f9d3cca807ffc7"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "bfe60566e68821c87ec1124c3b60ac15" -> "367974a95a4364ce1a8d8c00963c202f"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "83d7e39948a32745c3e00acfa81f0775" -> "07504c4561b71f6ed8028214ce83a077"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "e4131bd38321bcc8dae9b4b2d9ae606e" -> "e33e5224561301e3f0d5395065573528"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c1c2b6d8fb2fe63a419fb344fb14543d" -> "a8fb59942bf476fd1c0a964b274d214d"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "9e7953263f48b90be8c58ee4a39c66f8" -> "fbfcf5653740c4ecbc5bf4840f461de7"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "2f8c370c7f6c89ad51dbbc9bede93fdc" -> "e62735db5bd6f06fd620daa5ed9a118c"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "7d9f0191effde14274151ee9a62a55b7" -> "4c428894d45fb9838f16d3f92e21cdf3"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "8c7e59b21f5137167371e416dd60d597" -> "7bd1c7c7ce2b0353e2ef26a20a3f1726"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "cd0034257356293578248885a6547dcf" -> "b14725c52b6cc6c04fb331246427592d"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "8d5bd82bb8566de2dda53e4b84b423dd" -> "72c4aa24a554d7b30f696c47bfd98c5d"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "15bf5b42b757fbfdd79dd7e3a6aa1f20" -> "e132b77342b6ee9f38220a6f2aeb74d9"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "99b177d1995b2054bb58617041baed0f" -> "b29320dbc2d43191cd27b7f635d896a6"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "02db5f86ea9e7a678eeebe5985c1b259" -> "18910f89924b9bf2acc28e25bc61d255"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "b7093c5e3a021ef9e61f7a0db6d2fcae" -> "1206190f676c9737517c35000b221f07"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "c151674dbcbc1a085261b37fe21088ab" -> "fa5ad5464338fc25c66ddd48723c4d7a"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f07b32129180eeef032d2b636c69946d" -> "219e425fe097e7db2627e3a8b860ffd7"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "6ddef67d1582f24ac0d020bc9e72449f" -> "3976032d1f7a60560dbd7f8f6f18c8ac"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "cfad19a9cf91b2abfc82eeb317eee8b6" -> "06a7645891bee91872113b19389c3dfa"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "adcfc5e29eb180df64d8210b6fcfdbc6" -> "93244e2d2be66250e08749dd088e07a9"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "22ee05ebfc08eaee8eeb2175b39642c7" -> "d6a9152f10c623184660127bc241cf74"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "bb85a9370091b0bbfb6175ff268d645e" -> "ba6f75e8145ce2e935264fd690c9e83c"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "5b02798322bddf80bb154e29612e1c7f" -> "a32051be36999935276f3ea2d6078e03"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "ef43aac585b580c5ee4e070f21af1075" -> "2cde4150377663c743aecbde5af92e60"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "d651b0c4cc267bef137b713a943f1d8e" -> "30f78d71f10aeb6afff850f06ecde39b"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "65a1007208faa96bf93d944edf2bfd8c" -> "41e46695145cb06b717211b64ded08de"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "71e532075095176ed11332ee8e48a5d1" -> "0a6ac63cfcdfc99ac90dbb0bcd647c75"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "8237ed4cbdcea80791bc7a8e089695d2" -> "0ef25447b0e42702d999749a371d83b1"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "c5d79fb3a93aa39fa3e47425eb0b5eeb" -> "6593985eccb9f21c47f9bc432f051d06"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "3f7df2c9ee5178e4fec54698e058e708" -> "d723314a668b9aedd1d9b8003d933b38"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "MS755qiXjgLVP+X+yFaB6a6xhoLmcUDtI/UksKzmeSg=" -> "HTuZww7euC4hs7uC6eu9TCfoxhcPJ9xD95+gyXsdmvA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "t5PB/tKfdAJPBOiaHJm2VIYXg2IzGFdfRukyTVsFcSw=" -> "E2UywTT/yDsMdYMcFH9uLFmY9OgOmyZiAb76mdgx7cg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "EP1oOpdzjoaLVYylnauLPCuOVrInJRIg8S74ctePKwA=" -> "BZY6zh7Jaqa6O2oqJkoLwMiNvPKJIfwrghSIGsx/eiY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "kVgtuNDjZB00+7LZihhItd15GCOq3HDhtt42Owngscw=" -> "Jv/9OTcrkyl2zL6c64Y13kdGQ65Vwvxw5bj4bW7DxwA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "4+jMLJEK5h+0ZUdCWirqhVXZzNvdObpXQHZgn69gejM=" -> "/1NdEj8o3IWtuV/Lwv4xKCI/xWr5ihlcjnrUZ8xJYc0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "q37c5Wmgq84RePz6v9QkhEVuNOg4NndYVQLOTQsPD1o=" -> "yV9mXtoq/sSzkcWe1l92dnY5jxtcP2Q7QpWKVj9tKqo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "uufMUu2rMzYQGZrYWf/GcZ7G2CXnPDSybSVnIUzWLEg=" -> "2FhNNM2BwPwKQiLbawnlIyeuTZ/jh2Y2m+na74scJgk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "BzTlkL5pvC4B8zXVE32MGz2VD2SdznqZjhhcoKnInNo=" -> "g1gsdoglEW1+BDUsb9MUAj6LmC31/uFY39+UT/ExHug="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "IgpBSWXxx2bgVRmUWMd8VPvq9AACWnxQQGBBxvYl+iY=" -> "7fJiF7QiNlm1ZhhooyQCoyODO2ZZguvnTF58TiRHlhI="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "JsMhorwkj2ryJ3WvNhmO1Xwc4n2onciSdNKmVED8cxg=" -> "vLydR0pZJ8xOddNOJPwaUHh3Umx7bOCHJZqNNqC7E3k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "NTgs+EyV/uC7GAH+q5N6iXEjaOl7VsLmVCjie7TIZts=" -> "baJtllLImk0/VHe2SMSxTgOZvphhma1AvLv1QDOMwOQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "FuEnSMwco8rGsBlmHZEKCBWYDtGopyQIdiy6j/0foQI=" -> "bt35JRhYK5woDxxnZLLHxamzN+txVG2yHClzkNrAx3E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "ttHHWOjEmrp31tuMIbhutFvmN4CS11e2hegvfoMRpLM=" -> "8FjV7KX+XpxlY/TsQ5Ea7UVQj4uM5YflrM0PkD2Reks="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "JMZLwZlG1PaQPeG4/HRaT4o1W4wGjNqL/of2+xyxgR4=" -> "hjRkKy35Pky6HMtC72ZPN826bKh0nbbEc7sX4XprzrU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "+uaM3gisk85HGF3LIIjsl0tmLxIQSdvcU0yj8/G2RBE=" -> "fwSat+tywz3OIBshaqfbroqBwHAtS2xqg02aOaGop7Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "JQ4HpohmMzVKwIikH2oBswNW/c3W3d42GuSDfXgflfU=" -> "KBDJZROuIYPUCi4UDcTfqtgqFSKjnF5wrZWBF157TNA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "qbxcaFqfw4wkF/nOtxN6GdS3mUmI8u+5u4obaEY+0Dg=" -> "32v4kaXnZqRbYS9Oh3XSB/FyP9GQ3qsCXx0yvaIS2sQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "AKGaLAeQWRKB7AFl3ksz/3unRswGmvTBwPWR3ZLaoso=" -> "TPJfccvl8xw6au4PEb7Y0FpKRxtOIvNQWq1bwYjGAak="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "PoJcnVG+YKYdI0f0gEM2+YXIqwxC1fBBJuEhze1cGu8=" -> "G7EVbUEcBUONTZnNoCHIN8ZCTXMysw+lBKYgB9pmXD8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZXutaqjc+alJuTTMJ4mZ/R92/OTj7Wmq+Au9+t1dHPo=" -> "vHjMrzrUJliFIr3rq2ui+NvJ8xWg+O2dXVJB5URKFIg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "beL+wnKZ2YNJzkhbRdt3vvDTGMQNxASZNtZGrLvaV4s=" -> "1Tu7gNQhJakLjEyrvZRTvJCDNTuzPb3Vbr28uoj7Cj0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "+Oep8s+rgAVQIUjbaAugw6vAhtAXw4aTnZlxxm6CvS8=" -> "xq5+jRHnAHXvKTTBiIaJoZg3lroD9M89nQWnbHEN7n4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ec4PTpaTCimyooPR9JGzvjNed6ADmS/aHJxS6lnA0L8=" -> "q8bL6nM3vODowuB+xmLsmkxAqHiPM1LBWARgTdJLg0k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "zKnmt3zAr5FtIkeekRvvlbd+zO4+2+UiVvFRrWOuXgw=" -> "gMLxsTNrlTUZfVbofpH+WfAQkx0CAXK36hSDsWL8XA0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "ascV00k7JSj/eSSURQvDhxaX2heRLYoO15Kzup+ag/E=" -> "G+raArkY195nujSEhDxI6L/4KY3u11hXtVEaufEdNHo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "EfhGUT3tx76l9IJKs/abdDRcPA7ZoNxuYRn7DWKsOSk=" -> "7DAqAHXzOmTrAO7OC1hLP+V741tBhS2q4K9JcRc5Sng="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-19T23:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "qIp7vgSENcUGGXoS7BoW7JJmLJvv5BYlYkQRLL0TCRU=" -> "3Ms35zrCgz2ICAki0R9ekou5ornucwqB2HMRt9N+NpI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "2TqYioqTAyZd9ByLRnYCtGPxtz3cCOiVTUz4K9QprSM=" -> "FFdr7hbWLGKILcIQ/vqUGSXtBfbShqI40sU+RBWToYY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YvDN/QIqMRvslk1rzT14LivaplYSwARGwCxpaHkZsXk=" -> "IVdxVI5AjN4cyOyQWsODUI6bD3Lk5ejrmg7AXfaLZQQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "UkKU6G8Iu7SCSEeADvQGTt6DFwRFdClCJ01Hv3R9u4U=" -> "1nE1BcsO5+niKJ6A2/QZ8S9jrsUPLgm0zu73PSP1WMA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "6OkfGbruwr2rRZNx4EDL7in1U9yLbhwO0uANc9yHgVc=" -> "USbqc/k0fqiSdpFk3Et24mxvEaRiCldQTrf17Sma7c8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hx0mDGJQ8KbYBGGXh+sQggr+ReFQbScbkSVyY2Ux8Fg=" -> "UuxfKhcdDadR+dR+vH0jL3hkuDmtbX9SIFcF8Eq1zaE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "16A2pw8nlFTZMRLJmAaX+WwMPMA1m5dWz8O8pS/qp4w=" -> "wLmJ4ZjcuTHqaIbFtjS3tagQ07ZLbSsfM0AAGJcfUK0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "rNDDl0R1+sp5ZMVYyJyguWE9klc0E/5Qqj1YQ5o78oM=" -> "nv1hnfBfigtQ3ePMwswYcGpQkLJKU4ScGjBrTWeETys="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "tpgbDZeyoeDYVdL1ThTTXBSnRmWot7tMnJEL33edENA=" -> "kRSWw1WHuKUv0eJ1mzClxdK9TkDFDR0fUrp2LPonxzs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "rkNrxroIb5+pGcT/5abm2Zz5zByodb5483DnrG62kTM=" -> "/eEug3XMEQSSk7bklTR5opwcbvQgp0w1+pG+3er6M+8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "k0N7bTzCsWIFRXUEHAi10mmM2OGGi3KuL48YMwHHUAY=" -> "VqAur+8VT3t/5wOCIhGx1X9SUIVxmmwpd3IoBZQazrY="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "lrD03TZ5x+IRsQcP/qO7UX88DflVWTCL6QyciOg1ywk=" -> "77z/1ebcGSsamSTL8IfNkUIDZEC2MUEmVDIi7gj8dPM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pOtYEOP7d/6pXABh8Xkzd5nBlNk/bTD8eM+Cf2ZnJYo=" -> "8g0FldJbAWnJ5yFwSmSffv2gf6MC1XMUYMuHQhLheac="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "LzMBXltqcyzSOSK6aaUGlcZmCwhZt0ZEKV9futc3Iy8=" -> "YetsDlh7xSUHks985/6p6KSHDjM31BXVPykgw03t/tk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "oBYY3VO5AIx9u3oeHyX8prTXubkDk3qzb4Xa7iF65zI=" -> "8ziFRTVMLC4IxzU1rRpo8GVg3ry2mKbbf+BnUPfZ8/0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "9rNSPL3EkWYHmivfnK6J2q6H7BTNlns3mRGIUTRyE+E=" -> "PmJBuyHFQ3ytBgnQPUV8QE48L8gy/jhk12dQt97QglQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "xPTtZ/MMAyh8Wt0k4XVAvond94ke04WfNQazPOPu10I=" -> "xpq5jGYgu3uxTq5FtE3kCsRjH5zQu0fDd7DLx9YY+Fk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YlSya3dSMroenMmJmokC1/bsZ51e6fR/ZJbnCJvkN9A=" -> "aShjCB1E3toLAzFENxRHmVMohYkCD7KtL6QWGks9r0Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "Tcl/oaKuGRC8nEcSY+InRV+ZP2OBn6RB2wGeO7c91xg=" -> "WjfGHnOUC+DPWsmUz4X2/19P0pQ/romq4xskIekmsAw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-12T21:12:02Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "dk0err" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-12T21:12:01Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-12T21:12:00Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 93 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*